================================================================================
Tag with the Ruby hash
================================================================================

%a{:title => @title, :href => href}

--------------------------------------------------------------------------------

(source_file
  (tag
    (name)
    (attributes
      (ruby_attributes))))

================================================================================
Tag with the buffered code
================================================================================

%p= "hello"

--------------------------------------------------------------------------------

(source_file
  (tag
    (name)
    (evaluated_code)))

================================================================================
Tag with the buffered code that has spaces inside
================================================================================

%p= ['hi', 'there', 'reader!'].join " "

--------------------------------------------------------------------------------

(source_file
  (tag
    (name)
    (evaluated_code)))

================================================================================
Tag with the child Ruby hashes
================================================================================

.book-info{:data => {:book => {:id => 123, :genre => 'programming'}, :category => 7}}

--------------------------------------------------------------------------------

(source_file
  (tag
    (class)
    (attributes
      (ruby_attributes))))

================================================================================
Tag with the child Ruby hashes v2
================================================================================

%div{:id => ['Article', @article.number], :class => ['article', 'entry', @article.visibility]}

--------------------------------------------------------------------------------

(source_file
  (tag
    (name)
    (attributes
      (ruby_attributes))))

================================================================================
Only evaluated Ruby code
================================================================================

= "simple text"

--------------------------------------------------------------------------------

(source_file
  (evaluated_code))

================================================================================
Only running Ruby code
================================================================================

- @variable = 'test'

--------------------------------------------------------------------------------

(source_file
  (running_code))

================================================================================
Both runninga and evaluated Ruby code
================================================================================

- @variable = 'test'
= @variable

--------------------------------------------------------------------------------

(source_file
  (running_code)
  (evaluated_code))
