================================================================================
Tag with the name only
================================================================================

%p

--------------------------------------------------------------------------------

(source_file
  (tag
    (name)))

================================================================================
Tag with the class name only
================================================================================

.article

--------------------------------------------------------------------------------

(source_file
  (tag
    (class)))

================================================================================
Tag with ID only
================================================================================

#some-id

--------------------------------------------------------------------------------

(source_file
  (tag
    (id)))

================================================================================
Tag with name and ID
================================================================================

%p#some-id

--------------------------------------------------------------------------------

(source_file
  (tag
    (name)
    (id)))

================================================================================
Tag with name, ID and class
================================================================================

%p#some-id.article

--------------------------------------------------------------------------------

(source_file
  (tag
    (name)
    (id)
    (class)))

================================================================================
Tag with ID, class and name
================================================================================

#some-id.article%p

--------------------------------------------------------------------------------

(source_file
  (tag
    (id)
    (class)
    (name)))

================================================================================
Tag with name and HTML-style attributes
================================================================================

%html(xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en")

--------------------------------------------------------------------------------

(source_file
  (tag
    (name)
    (attributes
      (html_attributes
        (attribute
          (attribute_name)
          (quoted_attribute_value
            (attribute_value)))
        (attribute
          (attribute_name)
          (quoted_attribute_value
            (attribute_value)))
        (attribute
          (attribute_name)
          (quoted_attribute_value
            (attribute_value)))))))
